learn-coco-vm/01-main.org
#+TITLE: Understanding CoCo VM: ~main.cpp~
#+AUTHOR: Chen Zhou

This is a project for learning programming language theory. Since I do
not have much experience in computer science, I decide to go through a
real but simple project line by line, trying to interpret every code I
encountered during the process. The project I chose is the [[http://knuth.luther.edu/~leekent/CoCo/][CoCo
virtual machine]] for Python, which is implemented in C++ and has a book
dedicated to teaching basic programming theory as a company, thus the
learning procedure would be much facilitated.

* The ~main.cpp~ file.

A lots of header files from which we can glimpse the whole picture of
this virtual machine.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  #include "PyStack.h"
  #include "PyScanner.h"
  #include "PyParser.h"
  #include "PyCode.h"
  #include "PyObject.h"           // Oh, maybe I shall start here.
  #include "PyInt.h"
  #include "PyType.h"
  #include "PyFunction.h"
  #include "PyBuiltInPrint.h"
  #include "PyBuiltInFPrint.h"
  #include "PyBuiltInTPrint.h"
  #include "PyException.h"        // Include once.
  #include "PyExceptionType.h"
  #include "PyBuiltInInput.h"
  #include "PyStr.h"
  #include "PyFloat.h"
  #include "PyBool.h"
  #include "PyRange.h"
  #include "PyRangeType.h"
  #include "PyRangeIterator.h"
  #include "PyBuiltInIter.h"
  #include "PyBuiltInLen.h"
  #include "PyBuiltInConcat.h"
  #include "PyFrame.h"
  #include "PyException.h"        // Yes, include twice.
  #include <iostream>
  #include <fstream>
  #include <unordered_map>
  #include <csignal>
  #include <stdlib.h>
#+END_SRC

These header files can be organized in three major categories as Table
[[tab:header-files]].

#+CAPTION: Organization of header files
#+NAME: tab:header-files
| Python Objects    | Runtime Management | Parser      | Builtin Functions |
|-------------------+--------------------+-------------+-------------------|
| PyObject.h        | PyStack.h          | PyScanner.h | PyBuiltInPrint    |
| PyBool.h          | PyFrame.h          | PyCode.h    | PyBuiltInFPrint.h |
| PyInt.h           |                    |             | PyBuiltInTPrint.h |
| PyType.h          |                    |             | PyBUiltInInput.h  |
| PyFunction.h      |                    |             | PyBuiltInIter.h   |
| PyException.h     |                    |             | PyBuiltInLen.h    |
| PyExceptionType.h |                    |             | PyBuiltInConcat.h |
| PyStr.h           |                    |             |                   |
| PyRange.h         |                    |             |                   |
| PyRangeType.h     |                    |             |                   |
| PyRangeIterator.h |                    |             |                   |

* Stack

Following the header files is the implementation of stack.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  using namespace std;

  vector<PyFrame*> callStack;

  void pushFrame(PyFrame* frame) {
    callStack.push_back(frame);
    if (callStack.size() == 1000) {
      throw new PyException(PYILLEGALOPERATIONEXCEPTION, "Call Stack Overflow.");
    }
  }

  void popFrame() {
    callStack.pop_back();
  }
#+END_SRC

The ~callStack~ is actually a vector of ~PyFrame~ pointers. The
function ~pushFrame~ and ~popFrame~ utilize vector's method
~push_back~ and ~pop_back~ respectively. When push a new frame to the
stack, The function ~pushFrame~ also check whether the length of the
stack is over 1000, otherwise an ~PyException~ saying "Call Stack
Overflow" would be thrown.

* Signal Handler

The CoCo VM use signal to catch six uncaught exceptions.

#+caption: Signal and Exceptions
#+NAME: tab:sig-exp
| Signal  | Exception                              |
|---------+----------------------------------------|
| SIGABRT | Program Execution Aborted              |
| SIGFPE  | Arithmetic or Overflow Error           |
| SIGILL  | Illegal Instruction in Virtual Machine |
| SIGINT  | Execution Interrupted                  |
| SIGSEGV | Illegal Memory Access                  |
| SIGTERM | Termination Requested                  |

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  void sigHandler(int signum) {
    cerr <<"\n\n";
    cerr << "**********************************************************" << endl;
    cerr << "      An Uncaught Exception Occurred" << endl;
    cerr << "**********************************************************" << endl;
    cerr << "Signal: ";
    switch (signum) {
    case SIGABRT:
      cerr << "Program Execution Aborted" << endl;
      break;
    case SIGFPE:
      cerr << "Arithmetic or Overflow Error" << endl;
      break;
    case SIGILL:
      cerr << "Illegal Instruction in Virtual Machine" << endl;
      break;
    case SIGINT:
      cerr << "Execution Interrupted" << endl;
      break;
    case SIGSEGV:
      cerr << "Illegal Memory Access" << endl;
      break;
    case SIGTERM:
      cerr << "Termination Requested" << endl;
      break;
    }

    cerr << "----------------------------------------------------------" << endl;
    cerr << "                  The Exception's Traceback" << endl;

    // Go through the stack to print error information.
    for (int k=callStack.size()-1; k>=0; k--) {
      cerr << "==========> At PC="
	   << (callStack[k]->getPC()-1)
	   << " in this function."
	   << endl;
      cerr << callStack[k]->getCode().prettyString("",true);
      exit(0);
    }
  }
#+END_SRC

To produce error information when these exception happens, the
~sigHandler~ will go through the ~callStack~, print the relevant PC
and code in some readable format. The signals are all included by
~csignal~.

