learn-coco-vm/01-main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Understanding CoCo VM: <code>main.cpp</code></title>
<!-- 2016-03-05 周六 19:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Zhou" />
</head>
<body>
<div id="content">
<h1 class="title">Understanding CoCo VM: <code>main.cpp</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The <code>main.cpp</code> file.</a></li>
<li><a href="#sec-2">2. Stack</a></li>
<li><a href="#sec-3">3. Signal Handler</a></li>
<li><a href="#sec-4">4. Initiate Types</a></li>
<li><a href="#sec-5">5. Enter the <code>main</code> function</a></li>
<li><a href="#sec-6">6. Parse and Run</a></li>
</ul>
</div>
</div>
<p>
This is a project for learning programming language theory. Since I do
not have much experience in computer science, I decide to go through a
real but simple project line by line, trying to interpret every code I
encountered during the process. The project I chose is the <a href="http://knuth.luther.edu/~leekent/CoCo/">CoCo
virtual machine</a> for Python, which is implemented in C++ and has a book
dedicated to teaching basic programming theory as a company, thus the
learning procedure would be much facilitated.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The <code>main.cpp</code> file.</h2>
<div class="outline-text-2" id="text-1">
<p>
A lots of header files from which we can glimpse the whole picture of
this virtual machine.
</p>

<div class="org-src-container">

<pre class="src src-c++">#include "PyStack.h"
#include "PyScanner.h"
#include "PyParser.h"
#include "PyCode.h"
#include "PyObject.h"           // Oh, maybe I shall start here.
#include "PyInt.h"
#include "PyType.h"
#include "PyFunction.h"
#include "PyBuiltInPrint.h"
#include "PyBuiltInFPrint.h"
#include "PyBuiltInTPrint.h"
#include "PyException.h"        // Include once.
#include "PyExceptionType.h"
#include "PyBuiltInInput.h"
#include "PyStr.h"
#include "PyFloat.h"
#include "PyBool.h"
#include "PyRange.h"
#include "PyRangeType.h"
#include "PyRangeIterator.h"
#include "PyBuiltInIter.h"
#include "PyBuiltInLen.h"
#include "PyBuiltInConcat.h"
#include "PyFrame.h"
#include "PyException.h"        // Yes, include twice.
#include &lt;iostream&gt;
#include &lt;fstream&gt;
#include &lt;unordered_map&gt;
#include &lt;csignal&gt;
#include &lt;stdlib.h&gt;
</pre>
</div>

<p>
These header files can be organized in three major categories as Table
<a href="#tab:header-files">1</a>.
</p>

<table id="tab:header-files" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Organization of header files</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Python Objects</th>
<th scope="col" class="left">Runtime Management</th>
<th scope="col" class="left">Parser</th>
<th scope="col" class="left">Builtin Functions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">PyObject.h</td>
<td class="left">PyStack.h</td>
<td class="left">PyScanner.h</td>
<td class="left">PyBuiltInPrint</td>
</tr>

<tr>
<td class="left">PyBool.h</td>
<td class="left">PyFrame.h</td>
<td class="left">PyCode.h</td>
<td class="left">PyBuiltInFPrint.h</td>
</tr>

<tr>
<td class="left">PyInt.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">PyBuiltInTPrint.h</td>
</tr>

<tr>
<td class="left">PyType.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">PyBUiltInInput.h</td>
</tr>

<tr>
<td class="left">PyFunction.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">PyBuiltInIter.h</td>
</tr>

<tr>
<td class="left">PyException.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">PyBuiltInLen.h</td>
</tr>

<tr>
<td class="left">PyExceptionType.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">PyBuiltInConcat.h</td>
</tr>

<tr>
<td class="left">PyStr.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">PyRange.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">PyRangeType.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">PyRangeIterator.h</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Stack</h2>
<div class="outline-text-2" id="text-2">
<p>
Following the header files is the implementation of stack.
</p>

<div class="org-src-container">

<pre class="src src-c++">using namespace std;

vector&lt;PyFrame*&gt; callStack;

void pushFrame(PyFrame* frame) {
  callStack.push_back(frame);
  if (callStack.size() == 1000) {
    throw new PyException(PYILLEGALOPERATIONEXCEPTION, "Call Stack Overflow.");
  }
}

void popFrame() {
  callStack.pop_back();
}
</pre>
</div>

<p>
The <code>callStack</code> is actually a vector of <code>PyFrame</code> pointers. The
function <code>pushFrame</code> and <code>popFrame</code> utilize vector's method
<code>push_back</code> and <code>pop_back</code> respectively. When push a new frame to the
stack, The function <code>pushFrame</code> also check whether the length of the
stack is over 1000, otherwise an <code>PyException</code> saying "Call Stack
Overflow" would be thrown.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Signal Handler</h2>
<div class="outline-text-2" id="text-3">
<p>
The CoCo VM use signal to catch six uncaught exceptions.
</p>

<table id="tab:sig-exp" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Signal and Exceptions</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Signal</th>
<th scope="col" class="left">Exception</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">SIGABRT</td>
<td class="left">Program Execution Aborted</td>
</tr>

<tr>
<td class="left">SIGFPE</td>
<td class="left">Arithmetic or Overflow Error</td>
</tr>

<tr>
<td class="left">SIGILL</td>
<td class="left">Illegal Instruction in Virtual Machine</td>
</tr>

<tr>
<td class="left">SIGINT</td>
<td class="left">Execution Interrupted</td>
</tr>

<tr>
<td class="left">SIGSEGV</td>
<td class="left">Illegal Memory Access</td>
</tr>

<tr>
<td class="left">SIGTERM</td>
<td class="left">Termination Requested</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-c++">void sigHandler(int signum) {
  cerr &lt;&lt;"\n\n";
  cerr &lt;&lt; "**********************************************************" &lt;&lt; endl;
  cerr &lt;&lt; "      An Uncaught Exception Occurred" &lt;&lt; endl;
  cerr &lt;&lt; "**********************************************************" &lt;&lt; endl;
  cerr &lt;&lt; "Signal: ";
  switch (signum) {
  case SIGABRT:
    cerr &lt;&lt; "Program Execution Aborted" &lt;&lt; endl;
    break;
  case SIGFPE:
    cerr &lt;&lt; "Arithmetic or Overflow Error" &lt;&lt; endl;
    break;
  case SIGILL:
    cerr &lt;&lt; "Illegal Instruction in Virtual Machine" &lt;&lt; endl;
    break;
  case SIGINT:
    cerr &lt;&lt; "Execution Interrupted" &lt;&lt; endl;
    break;
  case SIGSEGV:
    cerr &lt;&lt; "Illegal Memory Access" &lt;&lt; endl;
    break;
  case SIGTERM:
    cerr &lt;&lt; "Termination Requested" &lt;&lt; endl;
    break;
  }

  cerr &lt;&lt; "----------------------------------------------------------" &lt;&lt; endl;
  cerr &lt;&lt; "                  The Exception's Traceback" &lt;&lt; endl;

  // Go through the stack to print error information.
  for (int k=callStack.size()-1; k&gt;=0; k--) {
    cerr &lt;&lt; "==========&gt; At PC="
	 &lt;&lt; (callStack[k]-&gt;getPC()-1)
	 &lt;&lt; " in this function."
	 &lt;&lt; endl;
    cerr &lt;&lt; callStack[k]-&gt;getCode().prettyString("",true);
    exit(0);
  }
}
</pre>
</div>

<p>
To produce error information when these exception happens, the
<code>sigHandler</code> will go through the <code>callStack</code>, print the relevant PC
and code in some readable format. The signals are all included by
<code>csignal</code>.
</p>
</div>
</div>
