learn-coco-vm/01-main.org
* Initiate Types

# Why?
Then the function ~initTypes~ is defined to generate a series of
types, which will return an ~unordered_map~.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  unordered_map<PyTypeId, PyType*, std::hash<int> > PyTypes;
  bool verbose = false;

  unordered_map<PyTypeId, PyType*, std::hash<int> > initTypes() {

      unordered_map<PyTypeId, PyType*, std::hash<int> > types;

      PyType* typeType = new PyType("type", PyTypeType);
      types[PyTypeType] = typeType;

      PyType* noneType = new PyType("NoneType", PyNoneType);
      types[PyNoneType] = noneType;

      PyType* boolType = new PyType("bool", PyBoolType);
      types[PyBoolType] = boolType;

      PyType* intType = new PyType("int", PyIntType);
      types[PyIntType] = intType;

      PyType* floatType = new PyType("float", PyFloatType);
      types[PyFloatType] = floatType;

      PyType* strType = new PyType("str", PyStrType);
      types[PyStrType] = strType;

      PyType* functionType = new PyType("function", PyFunctionType);
      types[PyFunctionType] = functionType;

      PyType* builtinType = new PyType("builtin_function_or_method", PyBuiltInType);
      types[PyBuiltInType] = builtinType;

      PyType* rangeType = new PyRangeType("range", PyRangeTypeId);
      types[PyRangeTypeId] = rangeType;

      PyType* exceptionType = new PyExceptionType("Exception", PyExceptionTypeId);
      types[PyExceptionTypeId] = exceptionType;

      PyType* rangeIteratorType = new PyType("range_iterator", PyRangeIteratorType);
      types[PyRangeIteratorType] = rangeIteratorType;

      PyType* listType = new PyType("list", PyListType);
      types[PyListType] = listType;

      PyType* funListType = new PyType("funlist", PyFunListType);
      types[PyFunListType] = funListType;

      PyType* tupleType = new PyType("tuple", PyTupleType);
      types[PyTupleType] = tupleType;

      PyType* listIteratorType = new PyType("list_iterator", PyListIteratorType);
      types[PyListIteratorType] = listIteratorType;

      PyType* listIteratorType = new PyType("funlist_iterator", PyFunListIteratorType);
      types[PyFunListIteratorType] = listIteratorType;

      PyType* tupleIteratorType = new PyType("tuple_iterator", PyTupleIteratorType);
      types[PyTupleIteratorType] = tupleIteratorType;

      PyType* strIteratorType = new PyType("str_iterator", PyStrIteratorType);
      types[PyStrIteratorType] = strIteratorType;

      PyType* codeType = new PyType("code", PyCodeType);
      types[PyCodeType] = codeType;

      PyType* cellType = new PyType("cell", PyCellType);
      types[PyCellType] = cellType;

      return types;
  }
#+END_SRC

# TODO: Type hierarchy.

Every type is produced by the constructor of class ~PyType~ which
receive a string as ~typeString~ and a ~PyTypeId~ as id. In turn,
~PyTypeId~ is actually an ~enum~ giving each type an id. The pointer
to the constructed ~PyType~ object would be stored as value in a
~unordered~ map whose key is the corresponding ~PyTypeId~.

* Enter the ~main~ function
The main function first sets up signal handler using the function
~signal~ from ~csignal~. Then once a signal appears, the specified
signal handler would start working.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  int main(int argc, char* argv[]) {
      char* filename;

      signal(SIGABRT, sigHandler);
      signal(SIGFPE, sigHandler);
      signal(SIGILL, sigHandler);
      signal(SIGINT, sigHandler);
      signal(SIGSEGV, sigHandler);
      signal(SIGTERM, sigHandler);
#+END_SRC

The following code adds measures to parse command line arguments.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
   if (argc != 2 && argc !=3) {
      cerr << "Invoke as : coco [-v] filename" << endl; // Expect 2-3 arguments.
      return 0;
   }

   PyTypes = initTypes();                 // Trigger type initializer.

   if (argc == 2)
      filename = argv[1];
   else {
       filename = argv[2];          // The last argument is the filename.
       verbose = true;              // Verbose switch on.
   }
#+END_SRC

Actually, the command line parser only cares about the number of
arguments. If the number is less than 2 or more than 3, the program
just print a usage information. And it does't care whether the first
argument is verbose switcher or not. If the ~argc~ is equal to 3, the
last argument would be recognized as a filename, and the verbose flag
would be switched on.

