learn-coco-vm/01-main.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Initiate Types</h2>
<div class="outline-text-2" id="text-4">
<p>
Then the function <code>initTypes</code> is defined to generate a series of
types, which will return an <code>unordered_map</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++">unordered_map&lt;PyTypeId, PyType*, std::hash&lt;int&gt; &gt; PyTypes;
bool verbose = false;

unordered_map&lt;PyTypeId, PyType*, std::hash&lt;int&gt; &gt; initTypes() {

    unordered_map&lt;PyTypeId, PyType*, std::hash&lt;int&gt; &gt; types;

    PyType* typeType = new PyType("type", PyTypeType);
    types[PyTypeType] = typeType;

    PyType* noneType = new PyType("NoneType", PyNoneType);
    types[PyNoneType] = noneType;

    PyType* boolType = new PyType("bool", PyBoolType);
    types[PyBoolType] = boolType;

    PyType* intType = new PyType("int", PyIntType);
    types[PyIntType] = intType;

    PyType* floatType = new PyType("float", PyFloatType);
    types[PyFloatType] = floatType;

    PyType* strType = new PyType("str", PyStrType);
    types[PyStrType] = strType;

    PyType* functionType = new PyType("function", PyFunctionType);
    types[PyFunctionType] = functionType;

    PyType* builtinType = new PyType("builtin_function_or_method", PyBuiltInType);
    types[PyBuiltInType] = builtinType;

    PyType* rangeType = new PyRangeType("range", PyRangeTypeId);
    types[PyRangeTypeId] = rangeType;

    PyType* exceptionType = new PyExceptionType("Exception", PyExceptionTypeId);
    types[PyExceptionTypeId] = exceptionType;

    PyType* rangeIteratorType = new PyType("range_iterator", PyRangeIteratorType);
    types[PyRangeIteratorType] = rangeIteratorType;

    PyType* listType = new PyType("list", PyListType);
    types[PyListType] = listType;

    PyType* funListType = new PyType("funlist", PyFunListType);
    types[PyFunListType] = funListType;

    PyType* tupleType = new PyType("tuple", PyTupleType);
    types[PyTupleType] = tupleType;

    PyType* listIteratorType = new PyType("list_iterator", PyListIteratorType);
    types[PyListIteratorType] = listIteratorType;

    PyType* listIteratorType = new PyType("funlist_iterator", PyFunListIteratorType);
    types[PyFunListIteratorType] = listIteratorType;

    PyType* tupleIteratorType = new PyType("tuple_iterator", PyTupleIteratorType);
    types[PyTupleIteratorType] = tupleIteratorType;

    PyType* strIteratorType = new PyType("str_iterator", PyStrIteratorType);
    types[PyStrIteratorType] = strIteratorType;

    PyType* codeType = new PyType("code", PyCodeType);
    types[PyCodeType] = codeType;

    PyType* cellType = new PyType("cell", PyCellType);
    types[PyCellType] = cellType;

    return types;
}
</pre>
</div>

<p>
Every type is produced by the constructor of class <code>PyType</code> which
receive a string as <code>typeString</code> and a <code>PyTypeId</code> as id. In turn,
<code>PyTypeId</code> is actually an <code>enum</code> giving each type an id. The pointer
to the constructed <code>PyType</code> object would be stored as value in an
unordered map whose key is the corresponding <code>PyTypeId</code>.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Enter the <code>main</code> function</h2>
<div class="outline-text-2" id="text-5">
<p>
The main function first sets up signal handler using the function
<code>signal</code> from <code>csignal</code>. Then once a signal appears, the specified
signal handler would start working.
</p>

<div class="org-src-container">

<pre class="src src-c++">int main(int argc, char* argv[]) {
    char* filename;

    signal(SIGABRT, sigHandler);
    signal(SIGFPE, sigHandler);
    signal(SIGILL, sigHandler);
    signal(SIGINT, sigHandler);
    signal(SIGSEGV, sigHandler);
    signal(SIGTERM, sigHandler);
</pre>
</div>

<p>
The following code adds measures to parse command line arguments.
</p>

<div class="org-src-container">

<pre class="src src-c++">if (argc != 2 &amp;&amp; argc !=3) {
   cerr &lt;&lt; "Invoke as : coco [-v] filename" &lt;&lt; endl; // Expect 2-3 arguments.
   return 0;
}

PyTypes = initTypes();                 // Trigger type initializer.

if (argc == 2)
   filename = argv[1];
else {
    filename = argv[2];          // The last argument is the filename.
    verbose = true;              // Verbose switch on.
}
</pre>
</div>

<p>
Actually, the command line parser only cares about the number of
arguments. If the number is less than 2 or more than 3, the program
just print a usage information. And it does't care whether the first
argument is verbose switcher or not. If the <code>argc</code> is equal to 3, the
last argument would be recognized as a filename, and the verbose flag
would be switched on.
</p>
</div>
</div>
