learn-coco-vm/01-main.org
* Parse and Run
The procedures to parse assembly and run instructions are all
contained in a huge try-catch block.

#+BEGIN_SRC c++ :tangle ./export/main.cpp
  try {
      PyParser* parser = new PyParser(filename);

      vector<PyCode*>* code = parser->parse();

      string indent = "";           // TODO: Why?

      for (int i = 0; i < code->size(); i++) {
	  cerr << (*code)[i]->prettyString(indent, false) << endl;
	  cerr << endl;
      }

      unordered_map<string, PyObject*> globals; // Global environment is a hashmap.

      globals["print"] = new PyBuiltInPrint();
      globals["fprint"] = new PyBuiltInFPrint();
      globals["tprint"] = new PyBuiltInTPrint();
      globals["input"] = new PyBuiltInInput();
      globals["iter"] = PyTypes[PyIterType];
      globals["float"] =  PyTypes[PyFloatType];
      globals["int"] =  PyTypes[PyIntType];
      globals["str"] =  PyTypes[PyStrType];
      globals["funlist"] = PyTypes[PyFunListType];
      globals["list"] = PyTypes[PyListType];
      globals["type"] = PyTypes[PyTypeType];
      globals["bool"] = PyTypes[BoolType];
      globals["range"] = PyTypes[PyRangeTypeId];
      globals["Exception"] = PyTypes[PyExceptionTypeId];
      globals["len"] = new PyBuiltInLen();
      globals["concat"] = new PyBuiltInConcat();

      bool foundMain = false;

      for (int i = 0; i < code->size(); i++) {
	  if ((*code)[i]->getName() == "main")
	      foundMain = true;

	  globals[(*code)[i]->getName()] = new PyFunction(*((*code)[i]),
							  globals,NULL);

	  if (!foundMain) {
	      cerr << "Error: No main() function found. A main() is required in CoCo VM programs."
		   << endl;
	      return 0;
	  }

	  vector<PyObject*>* args = new vector<PyObject*>();
	  PyObject* result = globals["main"]->callMethod("__call__", args);
      } catch (PyException* ex) {
	  cerr << "\n\n";
	  cerr << "*********************************************************" << endl;
	  cerr << "            An Uncaught Exception Occurred" << endl;
	  cerr << "*********************************************************" << endl;
	  cerr << ex->toString() << endl;
	  cerr << "---------------------------------------------------------" << endl;
	  cerr << "              The Exception's Traceback" << endl;
	  cerr << "---------------------------------------------------------" << endl;
	  ex->printTraceBack();
	  cerr << "*********************************************************" << endl;
	  cerr << "            An Uncaught Exception Occurred (See Above) " << endl;
	  cerr << "*********************************************************" << endl;
	  cerr << ex->toString() << endl;
	  cerr << "*********************************************************" << endl;
      }

      return 0;
   }
#+END_SRC

Every type would be registered in the global environment hashmap. The
parser first would generate a vector of ~PyCode~ object. The assembly
code would be printed, the labels in that assembly would be replaced
with the actual address location.

The CoCo VM demands the appearance of the ~main~ function. It will
traverse all the ~PyCode~ objects to find a function named as "main".
Meanwhile all code objects would be transformed to ~PyFunction~
objects and be registered in the global environment. The catch branch
would handle all exception once a ~PyException~ object is thrown.

In summary, the main file does three things:

1. Initialize all Python types.
2. Build global environment.
3. Invoke the "main" function.

The next note about CoCo VM will analyze ~PyObject~ which are central
to this Python VM implementation. Without understanding the ~PyObject~
and its deviation the parse would be a headache.
