learn-coco-vm/01-main.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Parse and Run</h2>
<div class="outline-text-2" id="text-6">
<p>
The procedures to parse assembly and run instructions are all
contained in a huge try-catch block.
</p>

<div class="org-src-container">

<pre class="src src-c++">try {
    PyParser* parser = new PyParser(filename);

    vector&lt;PyCode*&gt;* code = parser-&gt;parse();

    string indent = "";           // TODO: Why?

    for (int i = 0; i &lt; code-&gt;size(); i++) {
	cerr &lt;&lt; (*code)[i]-&gt;prettyString(indent, false) &lt;&lt; endl;
	cerr &lt;&lt; endl;
    }

    unordered_map&lt;string, PyObject*&gt; globals; // Global environment is a hashmap.

    globals["print"] = new PyBuiltInPrint();
    globals["fprint"] = new PyBuiltInFPrint();
    globals["tprint"] = new PyBuiltInTPrint();
    globals["input"] = new PyBuiltInInput();
    globals["iter"] = PyTypes[PyIterType];
    globals["float"] =  PyTypes[PyFloatType];
    globals["int"] =  PyTypes[PyIntType];
    globals["str"] =  PyTypes[PyStrType];
    globals["funlist"] = PyTypes[PyFunListType];
    globals["list"] = PyTypes[PyListType];
    globals["type"] = PyTypes[PyTypeType];
    globals["bool"] = PyTypes[BoolType];
    globals["range"] = PyTypes[PyRangeTypeId];
    globals["Exception"] = PyTypes[PyExceptionTypeId];
    globals["len"] = new PyBuiltInLen();
    globals["concat"] = new PyBuiltInConcat();

    bool foundMain = false;

    for (int i = 0; i &lt; code-&gt;size(); i++) {
	if ((*code)[i]-&gt;getName() == "main")
	    foundMain = true;

	globals[(*code)[i]-&gt;getName()] = new PyFunction(*((*code)[i]),
							globals,NULL);

	if (!foundMain) {
	    cerr &lt;&lt; "Error: No main() function found. A main() is required in CoCo VM programs."
		 &lt;&lt; endl;
	    return 0;
	}

	vector&lt;PyObject*&gt;* args = new vector&lt;PyObject*&gt;();
	PyObject* result = globals["main"]-&gt;callMethod("__call__", args);
    } catch (PyException* ex) {
	cerr &lt;&lt; "\n\n";
	cerr &lt;&lt; "*********************************************************" &lt;&lt; endl;
	cerr &lt;&lt; "            An Uncaught Exception Occurred" &lt;&lt; endl;
	cerr &lt;&lt; "*********************************************************" &lt;&lt; endl;
	cerr &lt;&lt; ex-&gt;toString() &lt;&lt; endl;
	cerr &lt;&lt; "---------------------------------------------------------" &lt;&lt; endl;
	cerr &lt;&lt; "              The Exception's Traceback" &lt;&lt; endl;
	cerr &lt;&lt; "---------------------------------------------------------" &lt;&lt; endl;
	ex-&gt;printTraceBack();
	cerr &lt;&lt; "*********************************************************" &lt;&lt; endl;
	cerr &lt;&lt; "            An Uncaught Exception Occurred (See Above) " &lt;&lt; endl;
	cerr &lt;&lt; "*********************************************************" &lt;&lt; endl;
	cerr &lt;&lt; ex-&gt;toString() &lt;&lt; endl;
	cerr &lt;&lt; "*********************************************************" &lt;&lt; endl;
    }

    return 0;
 }
</pre>
</div>

<p>
Every type would be registered in the global environment hashmap. The
parser first would generate a vector of <code>PyCode</code> object. The assembly
code would be printed, the labels in that assembly would be replaced
with the actual address location.
</p>

<p>
The CoCo VM demands the appearance of the <code>main</code> function. It will
traverse all the <code>PyCode</code> objects to find a function named as "main".
Meanwhile all code objects would be transformed to <code>PyFunction</code>
objects and be registered in the global environment. The catch branch
would handle all exception once a <code>PyException</code> object is thrown.
</p>

<p>
In summary, the main file does three things:
</p>

<ol class="org-ol">
<li>Initialize all Python types.
</li>
<li>Build global environment.
</li>
<li>Invoke the "main" function.
</li>
</ol>

<p>
The next note about CoCo VM will analyze <code>PyObject</code> which are central
to this Python VM implementation. Without understanding the <code>PyObject</code>
and its deviation the parse would be a headache.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Zhou</p>
<p class="date">Created: 2016-03-05 周六 19:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
